app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title LIKE %'Gilliam'% OR director LIKE %'Gilliam'% OR description LIKE %'Gilliam'%)
---
  def index
    @movies = Movie.all

INSERT INTO "movies" ("created_at", "description", "director", "image", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = 3  [["release_date", Fri, 08 Jun 1984 00:00:00 UTC +00:00], ["updated_at", Tue, 29 Sep 2015 19:15:35 UTC +00:00]]
---
  def update
    @movie = Movie.find(params[:id])

    if @movie.update_attributes(movie_params)